import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/src/foundation/key.dart';
import 'package:flutter/src/widgets/framework.dart';
import 'package:flutter/src/widgets/placeholder.dart';

import '../../model_components/article.dart';
import 'news_tile.dart';

class NewsList extends StatefulWidget {
  const NewsList({Key? key}) : super(key: key);

  @override
  State<NewsList> createState() => _NewsListState();
}

class _NewsListState extends State<NewsList> {
  List<Article> listNews = [
    Article(
      title:
          "เปิดแผน ‘รถเมล์ใหม่’ 7,200 คัน ‘ขสมก.-พลังงานบริสุทธิ์’ การันตี 3 ปี รถใหม่พรึ่บ",
      content:
          "แม้ปัจจุบันเมืองฟ้าอมรจะมีระบบขนส่งสาธารณะให้เลือกใช้มากมาย ทั้งรถไฟฟ้าลอยฟ้า รถไฟฟ้าใต้ดิน เรือโดยสารตามคลองต่างๆ หรือวินจักรยานยนต์ ตามจุดแยกย่อยทั่วกรุงเทพฯ แต่รถเมล์ หรือในชื่อทางการ ‘รถโดยสารประจำทาง’ ยังคงเป็นรถโดยสารสาธารณะที่มีผู้ใช้งานมากที่สุด",
      description:
          "ปัญหาหนึ่งของรถเมล์ไทยคือ มีสภาพเก่า บางคันใช้งานมามากกว่า 30 ปี รวมถึงปัญหาอื่นๆที่กลายเป็นความเคยชินไปแล้ว เช่น ปัญหาควันดำ, PM2.5 , เสียงดัง, การขับขี่ที่ไม่ปลอดภัย น่าหวาดเสียว, รอนาน , ไม่สะอาด ปัญหาการให้บริการ, เสียค่าเดินทางหลายทอด เป็นต้น ดังนั้น สิ่งที่คนกรุงเทพฯเรียกหามาโดยตลอด คือ การเปลี่ยนรถเมล์ใหม่ทั้งหมด และยกระดับการให้บริการให้ดีขึ้นกว่าที่เคยเป็น",
      urlToImage:
          "https://www.isranews.org/article/images/2022/KLE/8/Ling280865_Cover1.jpg",
      articleUrl:
          "https://www.isranews.org/article/images/2022/KLE/8/Ling280865_Cover1.jpg",
    ),
    Article(
      title:
          "ขสมก. จัดรถเมล์ฟรี 3 เส้นทางวิ่งบริการประชาชนร่วมกิจกรรมสวดมนต์ข้ามปี และจัดรถวิ่งเส้นทางเคานต์ดาวน์ปีใหม่ ขยายเวลาถึงตี 2",
      content:
          "วันนี้ (28 ธ.ค.65) นายกิตติกานต์ จอมดวง จารุวรพลกุล ผู้อำนวยการองค์การขนส่งมวลชนกรุงเทพ (ขสมก.) เผยว่า ขสมก.ได้จัดแผนการเดินรถโดยสารเพื่ออำนวยความสะดวก ปลอดภัย สร้างความมั่นใจในการเดินทางให้ผู้ใช้บริการในช่วงเทศกาลปีใหม่ 66 ตั้งแต่วันที่ 29 ธ.ค.65-4 ม.ค.66 ดังนี้ 1.ในเส้นทางปกติ จัดรถออกวิ่ง เฉลี่ยวันละ 2,744 คัน จำนวน 16,725 เที่ยว 2.จัดเดินรถ AIRPORT BUS เชื่อมต่อท่าอากาศยาน จำนวน 5 เส้นทาง เฉลี่ยวันละ 46 คัน ได้แก่ สาย A1 ท่าอากาศยานดอนเมือง-สถานีรถไฟฟ้า BTS จตุจักร เฉลี่ยวันละ 15 คัน, สาย A2 ท่าอากาศยานดอนเมือง-อนุสาวรีย์ชัยสมรภูมิ วันละ 12 คัน, สาย A3 ท่าอากาศยานดอนเมือง-สวนลุมพินี วันละ 7 คัน, สาย A4 ท่าอากาศยานดอนเมือง-สนามหลวง วันละ 7 คัน และ สาย S1 ท่าอากาศยานสุวรรณภูมิ-สนามหลวง วันละ 5 คัน",
      description:
          "3.จัดเดินรถเชื่อมต่อสถานีขนส่งกรุงเทพ 5 สถานี รวม 35 เส้นทาง ประกอบด้วย สถานีขนส่งกรุงเทพ (จตุจักร) หรือหมอชิต 2 จำนวน 12 เส้นทาง ได้แก่ สาย 3, 16, 49, 77, 96, 134, 136, 138, 145, 509, 517, และ 536, สถานีขนส่งเอกมัย 8 เส้นทาง ได้แก่ สาย 2, 23, 25, 71, 72, 501, 508 และ 511, สถานีขนส่งสายใต้ใหม่ 6 เส้นทาง ได้แก่ สาย 66, 79, 511, 515, 516 และ 556, สถานีรถไฟหัวลำโพง 6 เส้นทาง ได้แก่ สาย 4, 21, 25, 34, 73 และ 501 และสถานีกลางกรุงเทพอภิวัฒน์ (บางซื่อ) 3 เส้นทาง ได้แก่ สาย 3, 49 และ 67 4.จัดเดินรถโดยสารธรรมดา (เฉพาะกิจ) ให้บริการฟรี จำนวน 3 เส้นทาง เพื่อส่งประชาชนที่มาร่วมกิจกรรม “สวดมนต์ข้ามปี เสริมสิริมงคลทั่วไทย ส่งท้ายปีเก่า ต้อนรับศักราชใหม่ 2566” ที่วัดพระเชตุพนวิมลมังคลาราม และวัดอรุณราชวราราม วันที่ 31 ธ.ค.65 ตั้งแต่เวลา 00.00 น. ถึงเวลา 02.00 น. ของวันที่ 1 ม.ค.66 ได้แก่ วัดอรุณราชวราราม-อนุสาวรีย์ชัยสมรภูมิ 3 คัน, วัดพระเชตุพนวิมลมังคลาราม-อนุสาวรีย์ชัยสมรภูมิ 3 คัน และวัดพระเชตุพนวิมลมังคลาราม-ฝั่งตรงข้ามห้างสรรพสินค้าพาต้าปิ่นเกล้า 2 คัน",
      urlToImage:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/12/28/63ab9cf9e1aa31.22355116.jpg",
      articleUrl:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/12/28/63ab9cf9e1aa31.22355116.jpg",
    ),
    Article(
      title:
          "รถเมล์ไทยแฟนคลับ ฟาด! เปลี่ยนเลข สายรถเมล์! อาจทำผู้ใช้บริการ งง คนคิดไม่เคยใช้ คนใช้ไม่ได้คิด",
      content:
          "เมื่อวันที่ 18 มิถุนายน เพจ รถเมล์ไทยแฟนคลับ Rotmaethai โพสต์ข้อความ ประเด็นการเปลี่ยนสายเลขรถเมล์ โดยระบุข้อความประมาณว่า รถเมล์รอนาน รถเมล์หลังคารั่ว สงสารประชาชน ผู้ใช้บริการรถเมล์จริงๆ ท่านนายกฯ ช่วยประชาชนด้วย ในอนาคตอันใกล้ รถเมล์ ขสมก.และ รถร่วมบริการเอกชน จะเข้าสู่โครงการปฏิรูปเส้นทาง ตามนโยบายกรมการขนส่งฯ ซึ่งจะมี เส้นทางเก่า และเส้นทางใหม่ด้วย แต่! ทีมงานเพจรถเมล์ไทยแฟนคลับ และสมาชิกหลายๆคน ซึ่งเป็นคนที่ใช้บริการจริง งงกับเลขสายใหม่มากๆ อยากจะถามว่าจะเปลี่ยนเลขให้จำยากทำไม",
      description:
          "จะเป็นไปได้หรือไม่ ถ้าสายเก่าที่ประชาชนผู้ใช้บริการ เป็นประจำอยู่ทุกวันให้ใช้เลขสายเดิม ส่วนสายใหม่ก็ รันต่อจากเลขสายเดิมในระบบ เพราะเส้นบางเส้นทางที่กำหนดขึ้นมาใหม่ บางสาย มีอักษรภาษาอังกฤษต่อท้ายด้วย เช่น 4-23 E (เลขสายเดิมคือ 140 อู่แสมดำ - อนุสาวรียชัยฯ - ทางด่วน) ซึ่งคนเข้าใจความหมายของ E ก็จะทราบว่าเป็นรถทางด่วน แต่ถ้าคนที่ไม่รู้ภาษาอังกฤษจะเข้าใจหรือไม่",
      urlToImage:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/06/21/62b128e2dbc5e2.01565510.jpg",
      articleUrl:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/06/21/62b128e2dbc5e2.01565510.jpg",
    ),
    Article(
      title:
          "ประชาชนโวย เพจ ขสมก.พร้อมบวก โพสต์น้ำมันขึ้นราคา มานั่งรถเมล์กันดีกว่า",
      content:
          "(11 มี.ค.65) เพจเฟซบุ๊ก “ขสมก.พร้อมบวก” ขององค์การขนส่งมวลชนกรุงเทพ (ขสมก.) โพสต์ภาพอินโฟกราฟิกระบุว่า “น้ำมันขึ้นทุกวัน มาขึ้นรถเมล์กันดีกว่า ค่าโดยสารยังเท่าเดิม” พร้อมระบุว่า “ขึ้นทุกวัน แต่ค่ารถเมล์ยังเท่าเดิม ขสมก.ชวนคุณจอดรถไว้ที่บ้าน แล้วเดินทางไปกับรถเมล์ ขสมก. ประหยัด สะดวก สบาย ปลอดภัย ในวันที่ราคาน้ำมันพุ่งปรี๊ดดดด รถโดยสาร ขสมก.ยังคงเคียงข้างคุณ พร้อมให้บริการด้วยมาตรฐานการบริการและความสะอาดปลอดภัย",
      description:
          "ชาวเน็ตเห็นแล้วเข้าไปแสดงความคิดเห็นจำนวนมาก เช่น “รอเป็นชั่วโมงก็ไม่ไหว อยากชวน ผอ.ขสมก.มายืนรอด้วยกัน”  “รอนาน ขวาตลอด” ขวาตลอด ไม่จอดก็มี แอร์ไม่เย็น รอก็นาน บริการก็แย่ ประชาชนอะพร้อมบวก5555” “ทำสภาพตัวเองให้ดีก่อน เดี๋ยวคนก็แห่ไปขึ้นเองแหละ”  ซึ่งผู้ใช้เฟซบุ๊กเมนต์ว่า  “แอดมินไม่สนใจเข้ามาตอบความคิดเห็นของ ปชช.บ้างเลยเหรอ” ด้านแอดมินก็มาตอบ “ทุกกความคิดเห็นจากประชาชน ขสมก. จะนำข้อมูลไปพัฒนาการบริการต่อไปนะคะ",
      urlToImage:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/03/11/622ad17164a829.57026258.jpg",
      articleUrl:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/03/11/622ad17164a829.57026258.jpg",
    ),
    Article(
      title:
          "ขสมก.ขาดทุนสะสมแบกหนี้กว่า 1.32 แสนล้านบาท ครม.ให้กู้เสริมสภาพคล่อง 7,516 ล้านบาท",
      content:
          "วันนี้ (18 ก.ค.65)  น.ส.ไตรศุลี ไตรสรณกุล รองโฆษกประจำสำนักนายกรัฐมนตรี  กล่าวว่า คณะรัฐมนตรี (ครม.) อนุมัติให้องค์การขนส่งมวลชนกรุงเทพ (ขสมก.) กู้เงินเพื่อเสริมสภาพคล่องจำนวน 7,516 ล้านบาท  โดยให้กระทรวงการคลังเป็นผู้ค้ำประกันเงินกู้  พร้อมทั้งกำหนดวิธีการกู้เงิน เงื่อนไข และรายละเอียดการกู้เงิน  หลังกระทรวงคมนาคมรายงานว่า ขสมก.ประสบปัญหาการขาดสภาพคล่องทางการเงิน เนื่องจากผลประกอบการที่ขาดทุนและไม่ได้รับเงินชดเชยผลการขาดทุนตามจำนวนที่เกิดขึ้นจริง",
      description:
          "อย่างไรก็ตามขสมก.ได้จัดทำประมาณการเงินสดรับ-จ่าย ในปีงบประมาณ 2566 คาดว่าจะมีเงินสดคงเหลือปลายงวดขาดมือจำนวน 42,640 ล้านบาท ซึ่งไม่เพียงพอที่จะนำมาเป็นค่าใช้จ่ายในการดำเนินงาน ดั้งนั้นเพื่อให้เกิดสภาพคล่องทางการเงินและสามารถทำให้องค์กรบริหารจัดการต่อไปได้ ขสมก.จึงมีความจำเป็นต้องกู้เงินจำนวน 42,640 ล้านบาท โดยส่วนหนึ่งจะนำไปชำระคืนหนี้เงินกู้เดิมที่ครบกำหนดชำระและไถ่ถอนพันธบัตรเงินกู้ จำนวน 35,123 ล้านบาท ซึ่งได้นำเสนอสำนักงานบริหารหนี้สาธารณะ เพื่อบรรจุเข้าแผนการบริหารหนี้สาธารณะ ประจำปีงบประมาณ 2566 แล้ว จึงคงเหลือเงินกู้เพื่อเสริมสภาพคล่องทางการเงิน และเป็นเงินสดหมุนเวียนในการดำเนินงานของขสมก.ในปีงบประมาณ 2566 จำนวน 7,516 ล้านบาท  เป็นการชำระค่าเชื้อเพลิงวงเงิน 2,250 ล้านบาท, ชำระค่าเหมาซ่อม 1,422 ล้านบาท และเสริมสภาพคล่องทางการเงิน 3,844 ล้านบาท",
      urlToImage:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/07/18/62d52bc8e36625.35664431.jpg",
      articleUrl:
          "https://cdni-hw.ch7.com/dm/sz-md/i/images/2022/07/18/62d52bc8e36625.35664431.jpg",
    )
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      resizeToAvoidBottomInset: false,
      backgroundColor: Color.fromARGB(255, 235, 240, 244),
      appBar: PreferredSize(
        preferredSize: Size.fromHeight(70.0),
        child: AppBar(
          backgroundColor: Color.fromARGB(255, 255, 255, 255),
          shape: RoundedRectangleBorder(
            borderRadius: BorderRadius.vertical(
              bottom: Radius.circular(20),
            ),
          ),
          flexibleSpace: Container(
            decoration: BoxDecoration(
              borderRadius: BorderRadius.circular(20),
              gradient: LinearGradient(
                  begin: Alignment.centerLeft,
                  end: Alignment.centerRight,
                  colors: <Color>[
                    Color.fromARGB(255, 34, 50, 174),
                    Color.fromARGB(255, 37, 43, 99),
                  ]),
            ),
          ),
          // backgroundColor: colorBar,
          title: const Text(
            'ข่าวสาร',
            style: TextStyle(
              fontSize: 18,
              fontWeight: FontWeight.w800,
            ),
          ),
          centerTitle: true,
          actions: <Widget>[],
        ),
      ),
      body: Container(
        margin: EdgeInsets.only(top: 16),
        child: ListView.builder(
            itemCount: listNews.length,
            shrinkWrap: true,
            physics: ClampingScrollPhysics(),
            itemBuilder: (context, index) {
              return NewsTile(
                item: listNews[index],
                imgUrl: listNews[index].urlToImage,
                title: listNews[index].title,
                desc: listNews[index].description,
                content: listNews[index].content,
                posturl: listNews[index].urlToImage,
              );
            }),
      ),
    );
  }
}
